In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(data=data,index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(data,labels)

a    10
b    20
c    30
dtype: int64

In [6]:
np.random.seed(100)

In [7]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [8]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [9]:
df['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [10]:
# Each column is a series
type(df['W'])

pandas.core.series.Series

In [11]:
# Basically a dataframe contains one or more series
type(df)

pandas.core.frame.DataFrame

In [12]:
df['new'] = df['W'] + df['X']

In [13]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
C -0.189496  0.255001 -0.458027  0.435163  0.065506
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [14]:
# axis=1 is column
df.drop('new', axis=1)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [15]:
# axis = 0 is row
df.drop('C',axis=0)

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -1.407085
B  0.981321  0.514219  0.221180 -1.070043  1.495540
D -0.583595  0.816847  0.672721 -0.104411  0.233252
E -0.531280  1.029733 -0.438136 -1.118318  0.498452

In [16]:
df.loc['D']

W     -0.583595
X      0.816847
Y      0.672721
Z     -0.104411
new    0.233252
Name: D, dtype: float64

In [17]:
df.iloc[3]

W     -0.583595
X      0.816847
Y      0.672721
Z     -0.104411
new    0.233252
Name: D, dtype: float64

In [19]:
df.loc['B','Y']

0.22117966922140045

In [25]:
from typing import List
student_data = [
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]

def createDataframe(student_data: List[List[int]]) -> pd.DataFrame:
    cols = ['student_id','age']
    df = pd.DataFrame(data=student_data,columns = cols )
    return df

In [26]:
student_data

[[1, 15], [2, 11], [3, 11], [4, 20]]

In [28]:
df = createDataframe(student_data)

In [30]:
len(df)

4

In [31]:
list(df)

['student_id', 'age']

In [32]:
df[:2]

   student_id  age
0           1   15
1           2   11

In [33]:
df[df['student_id']==1]

   student_id  age
0           1   15

In [34]:
df['bonus'] = df['age']*2

In [35]:
df

   student_id  age  bonus
0           1   15     30
1           2   11     22
2           3   11     22
3           4   20     40

In [ ]:
df.drop_duplicates